openfoam/validation/poiseuille/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0    0    0)
    (2.2  0    0)
    (2.2  0.41 0)
    (0    0.41 0)

    (0    0    0.01)
    (2.2  0    0.01)
    (2.2  0.41 0.01)
    (0    0.41 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (220 41 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
